In [8]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
from textwrap import wrap

%matplotlib inline

In [9]:
df = pd.read_csv("../data/raw/df_final_experiment_clients.txt")
df

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
70604    2443347       NaN
70605    8788427       NaN
70606     266828       NaN
70607    1266421       NaN
70608    9895983       NaN

[70609 rows x 2 columns]

In [12]:
df[df["client_id"] == 9668240]

Empty DataFrame
Columns: [client_id, Variation]
Index: []

In [10]:
df.dropna(inplace=True, how="any")
df.reset_index(drop=True)

df

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
50495     393005   Control
50496    2908510   Control
50497    7230446      Test
50498    5230357      Test
50499    6334360      Test

[50500 rows x 2 columns]

In [11]:
df_experiment_clients = df
df_experiment_clients

       client_id Variation
0        9988021      Test
1        8320017      Test
2        4033851   Control
3        1982004      Test
4        9294070   Control
...          ...       ...
50495     393005   Control
50496    2908510   Control
50497    7230446      Test
50498    5230357      Test
50499    6334360      Test

[50500 rows x 2 columns]

In [ ]:
# create a dummy function to send to the exploration notebook
def import_df_experiment_clients():
    return (
        df_experiment_clients
        )